[
    {
        "text": "I'm incredibly grateful and honored to receive the \"Client Extraordinaire\" award from EY. \nThis recognition highlights the strong partnerships and trust we've built with our clients.\nHuge thanks to my amazing team for their support!! Special gratitude to,for always believing in me and all my mentors,,,whose guidance has been invaluable in helping me achieve this milestone. 😇\n\nAlso special thanks to my colleagues,,,,for working together to build customer confidence and deliver exceptional results.\n\nThis recognition wouldn't have been possible without your belief in me and our collective efforts.\n\nThank you once again to everyone who has been part of this journey. Let’s keep pushing boundaries and achieving excellence together! 💥",
        "engagement": {
            "likes": 0,
            "comments": 40
        }
    },
    {
        "text": "I’m happy to share that I’ve obtained a new certification: Microsoft Certified: Azure Data Fundamentals from Microsoft!",
        "engagement": {
            "likes": 0,
            "comments": 18
        }
    },
    {
        "text": "Just earned my Microsoft Certified: Azure Data Fundamentals! Excited for what comes next.",
        "engagement": {
            "likes": 0,
            "comments": 4
        }
    },
    {
        "text": "I’m happy to share that I’ve obtained a new certification: EY Artificial Intelligence - Applied AI - Bronze Learning (2024) from EY!",
        "engagement": {
            "likes": 0,
            "comments": 8
        }
    },
    {
        "text": "I am happy to share that I have successfully completed Bronze Learning badge in Applied AI.",
        "engagement": {
            "likes": 0,
            "comments": 4
        }
    },
    {
        "text": "I’m happy to share that I’ve been promoted to Associate Consultant at EY!",
        "engagement": {
            "likes": 0,
            "comments": 67
        }
    },
    {
        "text": "My journey at EY!!\n\nHearing about Anna’s sudden and tragic passing left me feeling deeply saddened. It’s heartbreaking to think of the immense grief and irreparable loss her family and friends must be experiencing. My deepest condolences to the family and friends.\n\nRecently, while reading various posts on LinkedIn about people's experiences at Big4 firms, I found myself reflecting on my own 8.5-year journey at EY—a path that, in many ways, feels unique.\n\nMy time at EY was filled with moments of gratitude, empathy, and respect, and it shaped me profoundly, both personally and professionally. After 8.5 years of navigating the inevitable ups and downs, I recently made the decision to resign, feeling it was the right time to explore a different career path. It wasn’t an easy decision, but it came after a period of immense learning, growth, and resilience.\n\nOne of the standout features of my time at EY was the emphasis on empathy, which I experienced firsthand from my leaders—partners, directors, senior managers, and managers alike. During difficult times, such as when I was unwell or when my parents underwent surgeries, I was never burdened by work demands. Instead, I was met with genuine concern for my well-being and given the space to focus on my family. This kind of support, which I believe is sometimes overlooked in broad-brush discussions about corporate culture, was a defining part of my experience. It’s something I’ve made a point to carry forward in my own approach to leadership.\n\nOf course, like many others, I had my share of long nights at work. I can still remember coming home at 4 a.m., but even during the busiest times, I always tried to listen to my body and maintain a balance. I learned to prioritize my health—through regular exercise and eating well—even when circumstances made it challenging.\n\nHere are a few key lessons I’ve taken away from my time at EY:\n1. Empathy is key: True leadership involves creating a culture of empathy, openness, and respect.\n\n2. Take time for yourself: Listen to your body and mind. Don’t hesitate to take a break when you need it, and don’t underestimate the value of rest.\n\n3. Prioritize your health: No matter how intense work gets, make time for physical activity. I committed to working out at least four times a week.\n\n4. Healthy choices are within reach: Even during late nights at the office, you can choose to nourish your body with healthy options. While you might not always control your hours, you can control how you fuel yourself.\n\n5. Avoid generalizations: Not all managers or teams at Big4 firms are the same. Each person comes with their own unique goals, perspectives, and leadership styles. It’s important to appreciate this diversity rather than generalizing the culture.\n\nSo, while I understand the experiences shared in many posts, I feel it's important to acknowledge that there are different stories—mine being one of them.",
        "engagement": {
            "likes": 0,
            "comments": 5
        }
    },
    {
        "text": "Hello everyone,\n\nIntroducing MeteorDash, an engaging web-based game developed with Next.js. In this game, your hand movements control the action based on how you tilt your hand. The game pauses when hands are not detected and resumes when both hands are back in view.\n\nI'd love for you to try it out and welcome any suggestions for improvement in my project.\n\nCheck it out here:\nExplore the code here:\n\nNote:\n1. Provide camera access to play the game.\n2. Close the tab to completely end the game.",
        "engagement": {
            "likes": 0,
            "comments": 4
        }
    },
    {
        "text": "Just earned my Microsoft Certified: Azure Fundamentals! Excited for what comes next.",
        "engagement": {
            "likes": 0,
            "comments": 8
        }
    },
    {
        "text": "Balancing my professional responsibilities with my passion for website development. Always finding time to enhance my skills and work on exciting projects in free time.\n\nProject: A landing product page for iPhone 15 series made with the help of Vite-React and tech libraries like gsap and threejs.\n\nWebsite link:\n\nGithub link:",
        "engagement": {
            "likes": 0,
            "comments": 10
        }
    },
    {
        "text": "EY has been ranked as one of the 25 workplaces in India to grow your career in the 2024 LinkedIn Top Companies List in \nhashtag\n#India. \n\nA big shoutout to our EY family who are the core of all that we do.\n\nThis is a true testament to our promise of offering exceptional experiences to our people.\n\nCheers to the builders of a better working world without whom this recognition wouldn't have been possible.\n\n||||",
        "engagement": {
            "likes": 0,
            "comments": 43
        }
    },
    {
        "text": "View my verified achievement from EY.",
        "engagement": {
            "likes": 0,
            "comments": 0
        }
    },
    {
        "text": "I’m happy to share that I’ve obtained a new certification: Microsoft Certified: Power Platform Fundamentals from Microsoft!",
        "engagement": {
            "likes": 0,
            "comments": 1
        }
    },
    {
        "text": "Meanwhile pending bills & EMIs: \"Excuse me, brother, brother idhar\"",
        "engagement": {
            "likes": 0,
            "comments": 0
        }
    },
    {
        "text": "Every skill, every tool, all at once 🧑🏻‍💻",
        "engagement": {
            "likes": 0,
            "comments": 1
        }
    }
]